Revit 2027 API
BuiltInFailures.RebarFailures.SketchDimensionsRemoved Property
 The sketch dimensions, that were used to create the sketch, have been removed from the completed rebar shape definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SketchDimensionsRemoved { get; }
Public Shared ReadOnly Property SketchDimensionsRemoved As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SketchDimensionsRemoved {
	FailureDefinitionId^ get ();
}
static member SketchDimensionsRemoved : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace